Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: The following variables exist within any registry-loop.
ja: どのレジストリ-ループ内にも、以下の変数が存在します。

source: The following verbs are currently supported:
ja: 現在、以下の動詞に対応しています：

source: The following window types are supported:
ja: 以下のウィンドウタイプがサポートされています：

source: The following window types are supported: 1) Standard file-open or file-save dialogs; 2) Explorer windows; 3) Console (command prompt) windows.
ja: 以下のウィンドウタイプがサポートされています：1) 標準的なファイルを開く、またはファイルを保存するダイアログ、2) エクスプローラーウィンドウ、3) コンソール（コマンドプロンプト）ウィンドウ。

source: The following words are supported:
ja: 以下の単語に対応しています：

source: The following words are supported: bold, italic, strike, underline, and norm.
ja: 以下の単語に対応しています：bold、italic、strike、underline、norm。

source: The for-loop documentation details the process by which an enumerator is called.
ja: forループのドキュメントでは、列挙者が呼び出されるまでのプロセスを詳しく説明しています。

source: The for-loop's variables correspond to the enumerator's parameters, which are:
ja: forループの変数は、列挙者のパラメータに対応しており、次のようになっています：

source: The format is:
ja: 形式：

source: The formatting of the version number allows a script to check whether A_AhkVersion is greater than some minimum version number with > or >= as in this example:
ja: バージョン番号の書式設定により、スクリプトはA_AhkVersionがこの例のように>または>=で指定された最小バージョン番号より大きいかどうかをチェックすることができる：

source: The formatting of the version number allows a script to check whether A_AhkVersion is greater than some minimum version number with > or >= as in this example: if (A_AhkVersion >= "1.0.25.07").
ja: バージョン番号の書式設定により、スクリプトはA_AhkVersionがこの例のように>または>=で指定された最小バージョン番号より大きいかどうかをチェックすることができる：if (A_AhkVersion >= "1.0.25.07")。

source: The fourth button (XButton1) and the fifth button (XButton2) might be assignable if your mouse driver allows their clicks to be seen by the system.
ja: 第4ボタン（XButton1）と第5ボタン（XButton2）は、マウスドライバーによってクリックがシステムから見えるようになっていれば、割り当て可能な場合があります。

source: The full 64-bit range of signed integer values is now supported (increased from 32-bit).
ja: 符号付き整数値の64ビット全範囲をサポートするようになりました（32ビットから増加）。

source: The full command string for the above is registered as InstallCommand under HKLM\Software\AutoHotkey or HKCU\Software\AutoHotkey, with %1 as the substitute for the source directory.
ja: 上記の完全なコマンド文字列は、%1をソースディレクトリの代用として、HKLM\Software\AutoHotkeyまたはHKCU\Software\AutoHotkeyの下でInstallCommandとして登録される。

source: The full display name of a component (case-insensitive).
ja: コンポーネントの完全な表示名（大文字と小文字は区別されない）。

source: The full name of each class is stored in ClassName.Prototype.__Class.
ja: 各クラスの完全な名前はClassName.Prototype.__Classに格納されます。

source: The full name of the key which contains the current loop item.
ja: 現在のループ項目が含まれるキーのフルネーム。

source: The full name of the registry key, e.g. "HKLM\Software\SomeApplication".
ja: レジストリキーのフルネームです。例："HKLM\Software\SomeApplication"。

source: The full name of the registry key.
ja: レジストリキーのフルネームです。

source: The full path and name of the EXE file that is actually running the current script.
ja: 現在のスクリプトを実際に実行しているEXEファイルのフルパスと名前。

source: The full path and name of the Programs folder in the all-users Start Menu.
ja: 全ユーザーのスタートメニューにあるProgramsフォルダのフルパスと名前。

source: The full path and name of the Programs folder in the current user's Start Menu.
ja: 現在のユーザーのスタートメニューにあるProgramsフォルダのフルパスと名前。

source: The full path and name of the Startup folder in the all-users Start Menu.
ja: 全ユーザーのスタートメニューのスタートアップフォルダのフルパスと名前。

source: The full path and name of the Startup folder in the current user's Start Menu.
ja: 現在のユーザーのスタートメニューにあるスタートアップフォルダのフルパスと名前。

source: The full path and name of the all-users Start Menu folder.
ja: 全ユーザーのスタートメニューフォルダのフルパスと名前。

source: The full path and name of the current user's "My Documents" folder.
ja: 現在のユーザーの「My Documents」フォルダのフルパスと名前。

source: The full path and name of the current user's Start Menu folder.
ja: 現在のユーザーのスタートメニューフォルダのフルパスと名前。

source: The full path and name of the file to which A_LineNumber belongs.
ja: A_LineNumberが属するファイルのフルパスとファイル名。

source: The full path and name of the folder containing the all-users application-specific data.
ja: 全ユーザーのアプリケーション固有データを含むフォルダのフルパスと名前。

source: The full path and name of the folder containing the all-users desktop files.
ja: 全ユーザーのデスクトップファイルを含むフォルダーのフルパスと名前。

source: The full path and name of the folder containing the current user's application-specific data.
ja: 現在のユーザーのアプリケーション固有データを含むフォルダーのフルパスと名前。

source: The full path and name of the folder containing the current user's desktop files.
ja: 現在のユーザーのデスクトップファイルを含むフォルダーのフルパスと名前。

source: The full path and name of the folder designated to hold temporary files.
ja: 一時ファイルを保存するフォルダのフルパスと名前。

source: The full path and name of the icon to be displayed for LinkFile.
ja: LinkFileに表示するアイコンのフルパスと名前です。

source: The full path of the current script, e.g. C:\Scripts\My Script.ahk
ja: 現在のスクリプトのフルパス、例：C:\Scripts\My Script.ahk

source: The full path of the directory where the current script is located.
ja: 現在のスクリプトが置かれているディレクトリのフルパス。

source: The full range of 64-bit integers is supported.
ja: 64ビット整数の全範囲をサポートしています。

source: The function Thread "NoTimers" is similar to Critical except that it only prevents interruptions from timers.
ja: 機能Thread "NoTimers"は、タイマーからの割り込みを防ぐだけで、Criticalと似ています。

source: The function also receives the parameters that were passed to Address.
ja: また、この関数はAddressに渡されたパラメータを受け取ります。

source: The function assigned to each of the keys listed below can be overridden by modifying the Windows registry.
ja: 以下の各キーに割り当てられている機能は、Windowsのレジストリを変更することで上書きすることができます。

source: The function attempted to modify a nonexistent variant of an existing hotkey.
ja: この関数は、既存のホットキーの存在しない変種を変更しようとしました。

source: The function attempted to modify a nonexistent hotkey.
ja: この関数は、存在しないホットキーを変更しようとしました。

source: The function can return a value.
ja: 関数は、値を返すことができます。

source: The function can return a non-zero integer to prevent the script from exiting (with some rare exceptions) and subsequent functions from being called.
ja: この関数は0以外の整数を返すことで、スクリプトの終了（ごく稀な例外を除く）や後続の関数の呼び出しを防ぐことができる。

source: The function can then use IsSet() to determine if a value was provided.
ja: その後、この関数は IsSet() を使用して、値が提供されたかどうかを判断することができます。

source: The function cannot modify global variables directly (as it is assume-local as usual, and cannot contain declarations), but can call other functions which do.
ja: この関数はグローバル変数を直接変更することはできませんが（通常通り想定ローカルであり、宣言を含むことができないため）、グローバル変数を変更する他の関数を呼び出すことができます。

source: The function is always assume-local, since declarations cannot be used.
ja: 宣言は使えないので、この関数は常にassume-localである。

source: The function is called as a new thread, so starts off fresh with the default values for settings such as SendMode and DetectHiddenWindows.
ja: この関数は新しいスレッドとして呼び出されるため、SendModeや DetectHiddenWindowsなどの設定にデフォルト値が設定され、新しい状態で開始されます。

source: The function is never called when an end key is pressed.
ja: 終了キーが押されても、この関数が呼び出されることはありません。

source: The function is passed one parameter:
ja: この関数には1つのパラメータが渡されます：

source: The function is passed the following parameters:
ja: この関数には、以下のパラメータが渡されます：

source: The function object to call when an unhandled error occurs.
ja: 処理されないエラーが発生したときに呼び出す関数オブジェクトです。

source: The function object to call when the message is received.
ja: メッセージを受信したときに呼び出す関数オブジェクトです。

source: The function object to call when the script is exiting.
ja: スクリプトの終了時に呼び出す関数オブジェクトです。

source: The function object to call.
ja: 呼び出す関数オブジェクト。

source: The function returns 1 (true) if the system returned a caret position, but this does not necessarily mean a caret is visible.
ja: この関数は、システムがキャレット位置を返した場合、1（真）を返しますが、これは必ずしもキャレットが見えていることを意味するわけではありません。

source: The function should accept one parameter:
ja: この関数は1つのパラメータを受け取る必要があります：

source: The function should accept the following parameters:
ja: この関数は、以下のパラメータを受け付ける必要があります：

source: The function should accept two parameters:
ja: この関数は2つのパラメータを受け取る必要があります：

source: The function to call.
ja: 呼び出される関数です。

source: The function was called but it aborted with a fatal exception.
ja: 関数は呼び出されましたが、致命的な例外が発生して異常終了しました。

source: The function was called but was passed too many or too few arguments.
ja: 関数を呼び出したが、渡された引数が多すぎたり少なすぎたりした。

source: The function will examine and/or change some of the members.
ja: この機能は、メンバーの一部を検査したり、変更したりするものです。

source: The function would then have its own local variable (the parameter) with the same value as myVar, but would not be able to assign a new value to myVar.
ja: この場合、関数はmyVarと同じ値を持つ独自のローカル変数（パラメータ）を持つことになりますが、myVarに新しい値を代入することはできません。

source: The function's parameter and return value are described below.
ja: この関数のパラメータと戻り値について、以下に説明します。

source: The function's parameters and return value are described below.
ja: この関数のパラメータと戻り値について、以下に説明します。

source: The function, method or object to call when the event is raised.
ja: イベントが発生したときに呼び出す関数、メソッド、またはオブジェクトを指定します。

source: The functions MouseClick, MouseMove, and MouseClickDrag all have a parameter to override the default mouse speed.
ja: MouseClick、MouseMove、MouseClickDragの各関数には、デフォルトのマウススピードを上書きするパラメータがあります。

source: The functions StrGet and StrPut can be used to convert strings between the native encoding and some other specified encoding.
ja: StrGet、StrPut関数は、文字列をネイティブエンコーディングと他の指定されたエンコーディングの間で変換するために使用することができます。

source: The functions WinMinimize, WinMaximize, WinRestore, WinHide, WinShow, WinClose, and WinKill will act upon all the group's windows.
ja: WinMinimize、WinMaximize、WinRestore、WinHide、WinShow、WinClose、WinKill関数は、グループのすべてのウィンドウに対して作用します。

source: The functions WinMinimize, WinMaximize, WinRestore, WinHide, WinShow, WinClose, and WinKill will operate upon all the group's windows.
ja: WinMinimize、WinMaximize、WinRestore、WinHide、WinShow、WinClose、WinKill関数は、グループのすべてのウィンドウに対して作用します。

source: The general rule (in both v1 and v2) is that only space and tab are permitted, but in some cases other whitespace characters are tolerated due to C runtime library conventions.
ja: 一般的なルールとして（v1、v2ともに）スペースとタブのみが許可されていますが、Cランタイムライブラリの規約により他の空白文字が許容される場合もあります。

source: The global class object Object is based on Class.Prototype, which is based on Object.Prototype, so classes can inherit methods and properties from any of these base objects.
ja: グローバルなクラスオブジェクトであるObjectは、Object.PrototypeをベースとするClass.Prototypeをベースとしているので、クラスはこれらのベースオブジェクトのいずれかからメソッドとプロパティを継承することができます。

source: The globally unique identifier (GUID) of the object's class.
ja: オブジェクトのクラスのグローバル一意識別子（GUID）です。

source: The globally unique identifier (GUID) of the object's default interface.
ja: オブジェクトのデフォルトインターフェースのグローバル一意識別子（GUID）です。

source: The hand-shaped cursors (pointing and grabbing) are classified as Unknown.
ja: 手の形をしたカーソル（ポインティングとグラブ）はアンノウンに分類される。

source: The height is " h "."
ja: 高さは " h "."

source: The hook can usually be re-registered by suspending and un-suspending all hotkeys.
ja: フックの再登録は、通常、すべてのホットキーのサスペンドとアンサスペンドを行うことで可能です。

source: The hook may be reinstalled explicitly by calling this function, or automatically as a side-effect of enabling or disabling a hotkey or calling some other function which requires the hook.
ja: フックの再インストールは、この関数を呼び出すことで明示的に行うことも、ホットキーの有効・無効やフックを必要とする他の関数の呼び出しの副作用として自動的に行うこともできる。

source: The hook may time out up to 10 times, but is silently removed if it times out an 11th time.
ja: フックは10回までタイムアウトすることができますが、11回目にタイムアウトした場合は、静かに削除されます。

source: The hook might also be able to override any restrictions a game may have about which keys can be "mapped" to game actions.
ja: また、どのキーをゲームのアクションに「マッピング」するかというゲーム側の制限を、フックで上書きすることもできるかもしれません。

source: The horizontal scrolling width defaults to 3 times the width of the ListBox.
ja: 水平スクロールの幅は、デフォルトでListBoxの幅の3倍になっています。

source: The hotkey becomes disabled.
ja: ホットキーが無効になります。

source: The hotkey becomes enabled.
ja: ホットキーが有効になります。

source: The hotkey is implemented by polling the controller at regular intervals.
ja: ホットキーは、一定間隔でコントローラをポーリングすることで実装されます。

source: The hotkey is implemented by polling the joystick at regular intervals.
ja: ホットキーは、ジョイスティックを一定時間ごとにポーリングすることで実装されます。

source: The hotkey is implemented via the keyboard hook.
ja: ホットキーは、キーボードフックを介して実装されます。

source: The hotkey is implemented via the mouse hook.
ja: ホットキーは、マウスフックを介して実装されます。

source: The hotkey is implemented via the operating system's RegisterHotkey() function.
ja: ホットキーは、オペレーティングシステムのRegisterHotkey()関数で実装されます。

source: The hotkey is set to the opposite state (enabled or disabled).
ja: ホットキーが反対の状態（有効または無効）に設定されます。

source: The hotkey is suppressed (it lacks the tilde modifier).
ja: ホットキーは抑制されます（チルダ修飾子がありません）。

source: The hotkey requires both the hooks mentioned above.
ja: このホットキーには、上記の両方のフックが必要です。

source: The hotstring recognizer can also be reset by calling Hotstring "Reset".
ja: ホットストリングレコグナイザーをリセットするには、次のようにします。 Hotstring "Reset"。

source: The hotstring recognizer checks the active window each time a character is typed, and resets if a different window is active than before.
ja: ホットストリングレコグナイザーは、文字が入力されるたびにアクティブなウィンドウをチェックし、以前とは異なるウィンドウがアクティブな場合はリセットされます。

source: The hotstring will be triggered even when it is inside another word; that is, when the character typed immediately before it is alphanumeric.
ja: ホットストリングは、他の単語の中にあっても発動します。つまり、直前に入力された文字が英数字である場合、ホットストリングは発動します。

source: The hotstring's trigger string, preceded by the usual colons and option characters.
ja: ホットストリングのトリガー文字列で、その前に通常のコロンと オプション文字が入ります。

source: The icon file to be used.
ja: 使用するアイコンファイル。

source: The icon is also not shown by the balloon window if it lacks a Title (this does not apply to Windows 10 toast notifications).
ja: また、バルーンウィンドウにタイトルがない場合、アイコンは表示されません（Windows 10のトースト通知には適用されません）。

source: The identifier of the interface to return.
ja: 返すべきインターフェースの識別子。

source: The index of a component, where 1 is the first component.
ja: コンポーネントのインデックスで、1が最初のコンポーネント。

source: The index of the entry or tab, where 1 is the first entry or tab, 2 is the second, etc.
ja: エントリまたはタブのインデックスで、1は最初のエントリまたはタブ、2は2番目のエントリまたはタブ、など。

source: The index of the item, where 1 is the first entry, 2 is the second, etc.
ja: 項目のインデックスで、1が最初の項目、2が2番目の項目、などです。

source: The index of the item, where 1 is the first item, 2 is the second, etc.
ja: 項目のインデックスです。1は最初の項目、2は2番目の項目、のようになります。

source: The index of the value or values to remove.
ja: 削除する値（複数可）のインデックス。

source: The index or key between the brackets is an expression, so quote marks must be used for any non-numeric literal value.
ja: 括弧の間のインデックスまたはキーは式なので、数値以外のリテラル値には引用符を使用しなければならない。

source: The index parameter of an object's __Item property was invalid or out of range.
ja: オブジェクトの__Itemプロパティのindexパラメータが無効か範囲外でした。

source: The indexed property of a collection, which is usually named Item or item.
ja: コレクションのインデックス付きプロパティで、通常はItemまたはitemと名付けられます。

source: The information is passed as parameters to the function/method which handles the event, including the source Gui or control.
ja: これらの情報は、ソースGUIやコントロールを含む、イベントを処理する関数/メソッドにパラメータとして渡されます。

source: The initial focus is still set to the first input-capable control with the WS_TABSTOP style (as per default message processing by the system), unless that's a Button control, in which case focus is now shifted to the Default button.
ja: ただし、ボタンコントロールの場合は、デフォルトのボタンにフォーカスが移動します。

source: The inner function (or a function nested inside it) must refer to the variable non-dynamically.
ja: 内部関数（またはその内部にネストされた関数）は、変数を非動的に参照する必要があります。

source: The input level of a hotkey or non-auto-replace hotstring is also used as the default send level for any keystrokes or button clicks generated by that hotkey or hotstring.
ja: ホットキーまたは自動置換でないホットストリングの入力レベルは、そのホットキーまたはホットストリングによって生成されるすべてのキーストロークまたはボタンクリックのデフォルト送信レベルとしても使用されます。

source: The inputs are compared numerically.
ja: 入力は数値で比較される。

source: The inputs of a function are called parameters or arguments.
ja: 関数の入力は、次のように呼ばれます。 パラメータや引数などです。

source: The installer does the following:
ja: インストーラーは以下のことを行う：

source: The installer provides very few options, as most things can be configured after installation.
ja: ほとんどのことはインストール後に設定できるため、インストーラーが提供するオプションはほとんどない。

source: The installer registers a hidden shell verb named "launch", which executes the launcher with the /Launch switch.
ja: インストーラーは「launch」という名前の隠しシェル動詞を登録し、/Launchスイッチでランチャーを実行する。

source: The instructions above can be translated into the code below:
ja: 上記の指示は、以下のコードに変換することができます：

source: The integer types I1, I8, UI1, UI2, UI4 and UI8 are now converted to Integer rather than String.
ja: 整数型I1、I8、UI1、UI2、UI4、UI8は、StringではなくIntegerに変換されるようになりました。

source: The interface is retrieved from one of the following sources:
ja: インターフェイスは以下のいずれかのソースから取得される：

source: The interface pointer is used to locate the address of the virtual function which implements the interface method, and is also passed as a parameter.
ja: インターフェースポインタは、インターフェースメソッドを実装する仮想関数のアドレスを特定するために使用され、パラメータとしても渡されます。

source: The interface pointer must be released by passing it to ObjRelease when it is no longer needed.
ja: インターフェース・ポインターは、不要になったらObjReleaseに渡して解放しなければならない。

source: The item begins a new column in a popup menu.
ja: ポップアップメニューの新しい列を開始する項目です。

source: The item can be assigned a value by using any assignment operator immediately after the closing bracket.
ja: 閉じ括弧の直後に任意の代入演算子を使えば、その項目に値を代入することができる。

source: The item is right-justified within the menu bar.
ja: メニューバー内で項目が右寄せになります。

source: The item to check.
ja: チェックする項目。

source: The item to delete.
ja: 削除する項目。

source: The item to modify.
ja: 修正する項目。

source: The key history is also reset, but the main window is not shown or refreshed.
ja: キーヒストリーもリセットされますが、メインウィンドウの表示やリフレッシュはされません。

source: The key name in the .ini file.
ja: .iniファイル内のキー名です。

source: The key names "Return" and "Break" were removed.
ja: キー名「Return」「Break」を削除しました。

source: The key or key combo needs to go on the left of the ::.
ja: キーまたはキーコンボは::の左側に置く必要がある。

source: The keyboard can be used to move the mouse cursor as demonstrated by the fully-featured Keyboard-To-Mouse script.
ja: キーボードをマウスカーソルの移動に使うことができるのは、フル機能のKeyboard-To-Mouseスクリプトで実証済みだ。

source: The keyboard hook intercepts keyboard events and translates them to text by using ToUnicodeEx or ToAsciiEx (except in the case of VK_PACKET events, which encapsulate a single character).
ja: キーボードフックは、キーボードイベントを受信し、ToUnicodeExまたはToAsciiExを使用してテキストに変換します（1文字をカプセル化するVK_PACKETイベントの場合を除きます）。

source: The keyboard hook monitors keystrokes for the purpose of activating hotstrings and any keyboard hotkeys not supported by RegisterHotkey (which is a function built into the operating system).
ja: キーボードフックは、ホットストリングRegisterHotkey（オペレーティングシステムに組み込まれた機能）でサポートされていないキーボードホットキーを有効にする目的で、キーストロークを監視しています。

source: The keyboard hook or mouse hook is installed.
ja: キーボードフックまたはマウスフックが装着されています。

source: The keyword super must be followed by one of the following symbols:
ja: キーワードsuperの後には、以下の記号のいずれかをつけなければならない：

source: The keyword super must be followed by one of the following symbols: .[(
ja: キーワードsuperの後には、以下の記号のいずれかをつけなければならない：.[(

source: The keyword static can be used to explicitly declare a nested function as static, in which case any non-static local variables of the outer function are ignored.
ja: キーワードstaticは、入れ子になった関数を明示的にstaticと宣言するために使用します。この場合、外側の関数のstaticでないローカル変数は無視されます。

source: The keyword IsSet is reserved for the use shown here and cannot be redefined as a variable or function.
ja: キーワードIsSetは、ここに示す用途のために予約されており、変数や関数として再定義することはできない。

source: The language code itself is the last four digits on the left side of the equal sign below.
ja: 言語コードそのものは、下の等号の左側の最後の4桁である。

source: The language code itself is the last four digits on the left side of the first comma below.
ja: 言語コードは、最初のコンマの左側の最後の4桁です。

source: The last Catch can optionally be followed by Else.
ja: 最後のCatchは、オプションで次のように続けることができます。 Else。

source: The last component may optionally end with a linefeed as well.
ja: 最後のコンポーネントは、オプションとして、ラインフィードで終了することもできる。

source: The last found window can be used by all of the windowing functions except WinWait, WinActivateBottom, GroupAdd, WinGetCount, and WinGetList.
ja: 最後に見つかったウィンドウは、WinWait、WinActivateBottom、GroupAdd、WinGetCount、WinGetListを除くすべてのウィンドウ関数で使用できる。

source: The last script thread finishes.
ja: 最後のスクリプトスレッドが終了します。

source: The launcher can be enabled, disabled or configured via the Launch Settings GUI, which can be accessed via the dash.
ja: ランチャーは、DashボードからアクセスできるLaunch Settings GUIで有効化、無効化、設定することができます。

source: The launcher can be explicitly executed at the command line for cases where .ahk files are not set to use the launcher by default, or for finer control over its behaviour.
ja: ランチャーは、.ahkファイルがデフォルトでランチャーを使用するように設定されていない場合や、ランチャーの動作をより細かく制御したい場合に、コマンドラインで明示的に実行することができる。

source: The launcher enables the use of v1 and v2 scripts on one system, with a single filename extension, without necessarily giving preference to one version or requiring different methods of launching scripts.
ja: このランチャーは、1つのシステム上でv1とv2のスクリプトを1つのファイル名拡張子で使用できるようにするもので、必ずしもどちらかのバージョンを優先したり、スクリプトの起動方法を変えたりする必要はありません。

source: The launcher's exit code is the major version number (1 or 2) if identified by #Requires or syntax (if syntax detection is enabled), otherwise 0.
ja: ランチャーの終了コードは、#Requiresまたはシンタックス（シンタックス検出が有効な場合）で識別される場合はメジャーバージョン番号（1または2）、そうでない場合は0です。

source: The launcher's exit code is the process ID (PID) of the new script process.
ja: ランチャーの終了コードは、新しいスクリプト・プロセスのプロセスID（PID）である。

source: The left and right mouse buttons should be assignable normally (for example, #LButton:: is the Win+LeftButton hotkey).
ja: マウスの左右のボタンは普通に割り当てられるようにします（例えば、#LButton::はWin+LeftButtonのホットキーです）。

source: The left mouse button is kept held down while NumpadAdd is down, which effectively transforms NumpadAdd into the left mouse button.
ja: NumpadAddが押されている間、マウスの左ボタンを押し続けることで、NumpadAddが実質的にマウスの左ボタンに変化します。

source: The legacy command "if var is type" has been replaced with a series of functions:
ja: レガシーコマンドである "if var is type" は、一連の関数に置き換えられています：

source: The length includes elements which have no value.
ja: 長さには、価値のない要素も含まれます。

source: The length of the interval in milliseconds.
ja: インターバルの長さをミリ秒単位で指定します。

source: The length of the interval used by A_MaxHotkeysPerInterval, in milliseconds.
ja: A_MaxHotkeysPerIntervalが使用するインターバルの長さ（ミリ秒単位）。

source: The length of the range of values to remove.
ja: 削除する値の範囲の長さを指定します。

source: The length of the string can be inferred by the position of the null-terminator, but AutoHotkey also stores the length, for performance and to permit null characters within the string's length.
ja: 文字列の長さはヌル終端の位置から推測できますが、AutoHotkeyはパフォーマンスのため、また文字列の長さの範囲内でヌル文字を許可するために、長さも保存します。

source: The letter "i" in the last parameter makes the shortcut key be Ctrl+Alt+I.
ja: 最後のパラメーターに「i」を入れると、ショートカットキーがCtrl+Alt+Iになります。

source: The letters A-Z are considered identical to their lowercase counterparts.
ja: A～Zは小文字と同一視されます。

source: The letters a-z or A-Z can be used to refer to the corresponding virtual keycodes (usually vk41-vk5A) even if they are not included in the current keyboard layout.
ja: a-zまたはA-Zの文字は、現在のキーボードレイアウトに含まれていなくても、対応する仮想キーコード（通常はvk41～vk5A）を参照するために使用できます。

source: The library folders are searched in the order shown above.
ja: ライブラリフォルダは上記の順序で検索されます。

source: The library folders provide a few standard locations to keep shared scripts which other scripts utilise by means of #Include.
ja: ライブラリフォルダは、#Includeによって他のスクリプトが利用する共有スクリプトを保管するための、いくつかの標準的な場所を提供する。

source: The library locations are:
ja: 図書館の場所は以下の通り：

source: The licenses for most software are designed to take away your freedom to share and change it.
ja: ほとんどのソフトウェアのライセンスは、それを共有したり変更したりする自由を奪うように設計されている。

source: The lifetime of an address and which operations are valid to perform on it depend on how Value was passed to this function.
ja: アドレスの寿命と、そのアドレスに対してどの操作が有効かは、Valueがこの関数にどのように渡されたかに依存する。

source: The limit might be reached by means other than an infinite loop, such as:
ja: など、無限ループ以外の手段で限界に達する可能性があります：
